Revit 2027 API
BuiltInFailures.TrussFailures.TrussDuplicateEngineeringType Property
 Elements have duplicate 'Engineering Type' values.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TrussDuplicateEngineeringType { get; }
Public Shared ReadOnly Property TrussDuplicateEngineeringType As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TrussDuplicateEngineeringType {
	FailureDefinitionId^ get ();
}
static member TrussDuplicateEngineeringType : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.TrussFailures Class
Autodesk.Revit.DB Namespace